In [42]:
import pandas as pd

In [2]:
ls

0_Resources/  1_Pandas.ipynb  cricket.csv  NBA1.csv  NBA2.csv  NBA.csv

In [3]:
pd.read_csv("sample.csv")

    name             emailid    address  pincode sirname
0   sudh   sskumar@gmail.com  bengalore   560085   kumar
1  krish     krish@gmail.com  bengalore   560085    naik
2    sai       sai@gmail.com  hyderabad   500084     sai

In [4]:
df = pd.read_csv("sample.csv")

In [5]:
type(df)

pandas.core.frame.DataFrame

In [7]:
pd.read_csv("sample.csv",header=None)

       0                   1          2        3        4
0   name             emailid    address  pincode  sirname
1   sudh   sskumar@gmail.com  bengalore   560085    kumar
2  krish     krish@gmail.com  bengalore   560085     naik
3    sai       sai@gmail.com  hyderabad   500084      sai

In [8]:
pd.read_csv("sample.csv",header=None, names=['col1','col2','col3','col4','col5'])

    col1                col2       col3     col4     col5
0   name             emailid    address  pincode  sirname
1   sudh   sskumar@gmail.com  bengalore   560085    kumar
2  krish     krish@gmail.com  bengalore   560085     naik
3    sai       sai@gmail.com  hyderabad   500084      sai

In [9]:
pd.read_csv("sample.csv",header=None, names=['col1','col2','col3','col4','col5','col6'])

    col1                col2       col3     col4     col5  col6
0   name             emailid    address  pincode  sirname   NaN
1   sudh   sskumar@gmail.com  bengalore   560085    kumar   NaN
2  krish     krish@gmail.com  bengalore   560085     naik   NaN
3    sai       sai@gmail.com  hyderabad   500084      sai   NaN

In [10]:
pd.read_csv("sample.csv",header=None, names=['col1','col2','col3','col4'])

                     col1       col2     col3     col4
name              emailid    address  pincode  sirname
sudh    sskumar@gmail.com  bengalore   560085    kumar
krish     krish@gmail.com  bengalore   560085     naik
sai         sai@gmail.com  hyderabad   500084      sai

In [11]:
pd.read_csv("sample.csv",header=None, names=['col1','col2','col3'])

                               col1     col2     col3
name  emailid               address  pincode  sirname
sudh   sskumar@gmail.com  bengalore   560085    kumar
krish krish@gmail.com     bengalore   560085     naik
sai   sai@gmail.com       hyderabad   500084      sai

In [15]:
pd.read_csv("sample.csv", names=['col1','col2','col3','col4','col5'],sep=',')

    col1                col2       col3     col4     col5
0   name             emailid    address  pincode  sirname
1   sudh   sskumar@gmail.com  bengalore   560085    kumar
2  krish     krish@gmail.com  bengalore   560085     naik
3    sai       sai@gmail.com  hyderabad   500084      sai

In [16]:
df

    name             emailid    address  pincode sirname
0   sudh   sskumar@gmail.com  bengalore   560085   kumar
1  krish     krish@gmail.com  bengalore   560085    naik
2    sai       sai@gmail.com  hyderabad   500084     sai

In [19]:
pd.read_csv("sample.csv", names=['col1','col2','col3','col4','col5'],sep=',',skiprows=[1,2])

   col1           col2       col3     col4     col5
0  name        emailid    address  pincode  sirname
1   sai  sai@gmail.com  hyderabad   500084      sai

In [20]:
df.dtypes

name       object
emailid    object
address    object
pincode     int64
sirname    object
dtype: object

In [21]:
df.columns

Index(['name', 'emailid', 'address', 'pincode', 'sirname'], dtype='object')

In [22]:
df.head()

    name             emailid    address  pincode sirname
0   sudh   sskumar@gmail.com  bengalore   560085   kumar
1  krish     krish@gmail.com  bengalore   560085    naik
2    sai       sai@gmail.com  hyderabad   500084     sai

In [23]:
df.tail()

    name             emailid    address  pincode sirname
0   sudh   sskumar@gmail.com  bengalore   560085   kumar
1  krish     krish@gmail.com  bengalore   560085    naik
2    sai       sai@gmail.com  hyderabad   500084     sai

In [24]:
df.tail(1)

  name        emailid    address  pincode sirname
2  sai  sai@gmail.com  hyderabad   500084     sai

In [25]:
df.tail(2)

    name          emailid    address  pincode sirname
1  krish  krish@gmail.com  bengalore   560085    naik
2    sai    sai@gmail.com  hyderabad   500084     sai

In [26]:
df = pd.read_csv("sample.csv", names=['col1','col2','col3','col4','col5'],sep=',',skiprows=[1,2],)

In [29]:
df[['col1','col3']]

   col1       col3
0  name    address
1   sai  hyderabad

In [31]:
a = df['col1']

In [32]:
type(a)

pandas.core.series.Series

In [33]:
a = df[['col1']]

In [34]:
type(a)

pandas.core.frame.DataFrame

In [43]:
pd.read_excel('LUSIDExcel-BusinessAgility-MakingSimpleChangesQuicklyEasily.xlsx')

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,1) Create your Live Production Environment,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,In LUSID you can segregate environments by mak...,NaN,NaN,NaN,NaN,NaN,LUSID API Knowledge Base: Scopes.,NaN,NaN
14,NaN,NaN,NaN,NaN,Each scope has a unique code which is used to ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,NaN,NaN,NaN,NaN,To manage your client's assets you will also n...,NaN,NaN,NaN,NaN,NaN,LUSID API Knowledge Base: Portfolios,NaN,NaN
16,NaN,NaN,NaN,NaN,A portfolio lives within a given scope. Each p...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,NaN,NaN,"When you add a portfolio, you can specify whic...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,NaN,NaN,NaN,NaN,Scope:,Production-client,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
24,NaN,NaN,NaN,NaN,OK,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,NaN,NaN,NaN,NaN,DisplayName,Description,Code,Created,BaseCurrency,CorporateActionSourceId,AccountingMethod,SubHoldingKeys,Result
26,NaN,NaN,NaN,1.0,Pension-fund,Pension fund for new client,Pension-fund,2019-09-08 11:49:22.720000,GBP,NaN,AverageCost,NaN,Error creating portfolio with id Pension-fund ...
27,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28,NaN,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29,NaN,NaN,NaN,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
30,NaN,NaN,NaN,5.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
31,NaN,NaN,NaN,6.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
32,NaN,NaN,NaN,7.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
33,NaN,NaN,NaN,8.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34,NaN,NaN,NaN,9.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35,NaN,NaN,NaN,10.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [44]:
temp = pd.ExcelFile('LUSIDExcel-BusinessAgility-MakingSimpleChangesQuicklyEasily.xlsx')

In [45]:
temp.sheet_names

['Create Portfolio',
 'Introduction',
 'Create your instrument universe',
 'Add your take on balances',
 'Create your test environment',
 'Make live trades in production',
 'Add some test transactions',
 'Inputs']

In [48]:
pd.read_excel('LUSIDExcel-BusinessAgility-MakingSimpleChangesQuicklyEasily.xlsx',sheet_name='Create your instrument universe')

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
66,NaN,NaN,NaN,NaN,BBG0000D14P3,Active,LUID_OT7CC2W3,UKGiltTreasury_4.5_2034,imd_34534534,BBG0000D14P3,GB00B52WS153,UKT 4.5 09/07/34
67,NaN,NaN,NaN,NaN,BBG00FN3B5K8,Active,LUID_D8XILY4L,USTreasury_2.00_2021,imd_34535347,BBG00FN3B5K8,US912828U816,T 2 12/31/21
68,NaN,NaN,NaN,NaN,BBG000DQQNJ8,Active,LUID_MB2H1QYX,USTreasury_6.875_2025,imd_34534539,BBG000DQQNJ8,US912810EV62,T 6.875 08/15/25
69,NaN,NaN,NaN,NaN,BBG000BF6B57,Active,LUID_JTHZSWPE,WPP_LondonStockEx_WPP,imd_34536734,BBG000BF6B57,JE00B8KF9B49,WPP
70,NaN,NaN,NaN,NaN,BBG000BRVH05,Active,LUID_0E6TTHI3,Whitebread_LondonStockEx_WTB,imd_35349900,BBG000BRVH05,GB00B1KJJ408,WTB

In [49]:
pd.read_csv('https://gist.githubusercontent.com/jwalsh/ce1dc0436aba5b7a5c9666f47fa5a380/raw/5ce3854392b43ff97907112d344fc008229b0445/titanic.csv')

,PassengerId,Survived,Pclass,Lname,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund,Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen,Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen,Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,Pears,Mrs. Thomas (Edith Wearne),female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,Meo,Mr. Alfonzo,male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,van Billiard,Mr. Austin Blyler,male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,Olsen,Mr. Ole Martin,male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,Williams,Mr. Charles Duane,male,51.0,0,1,PC 17597,61.3792,NaN,C